def t_4():
    text = """По выборке объёма n = 13, извлечённой из нормальной генеральной совокупности 
    известным средним квадратичным отклонением о = 3, при уровне значимости
    0,05 проверяется нулевая  типотеза  H0 : мю = мю0 = 17 
    Требуется: а) найти мощность критерия для проверки гипотезы H0 : мю = мю0 = 16
    б) найти объём выборки n, при котором мощность критерия не меньше 0,92.
    мю0 = 17
    a = 0,05
    w0 = 0,92
    se = о/sqrt(n)
    w = 1 - betta = P(H1|H1) = P(z < zлев) = P((b) < zлев - h) мю = мю1
    h = (мю1 - мю0)/se
    z = (x‾ - мю0)/se ~ N(0,1)
    z < zлев
    (x‾ - мю0)/se < zлев
    (x‾ - мю1 + мю1 - мю0)/se < zлев
    b = (x‾ - мю1)se
    b + h < zлев
    b < zлев - h
    w = P(b < zлев - h)
    b ~ N(0,1)
    h1 = мю1 - мю0/ о/sqrt(n1) (se)
    w1 = P(z < zлев) мю = мю1) = P(b < zлев - h1) >= 0,92
    F0,1(Zлев - h1) >= 0,92
    zлев - h1 >= F^-1 0,1(0,92)
    zлев - мю1 - мю0/о/sqrt(n1) >= F^-1 0,1(0,92)
    n1 >= ?
    n1 >= sts.norm.ppf(0.92)
    n1 = 84
    """

    return text