Repository: pypi-data/pypi-mirror-320
Catalog: packages/django-j2fa/django_j2fa-3.8.14.tar.gz/django_j2fa-3.8.14/j2fa/locale/*/LC_MESSAGES/django.po
Languages: fi

source: 2-Factor Authentication
fi: SMS-varmenne

source: two.factor.code.label
fi: Tunnusluku

source: One time login code
fi: Kertakäyttöinen tunnusluku

source: j2fa.code.email.body
fi: {code} on kertakäyttöinen tunnuslukusi. Älä anna tätä kenellekään ja ohita tämä sähköposti jos et itse ole juuri nyt kirjautumassa palveluun.

source: Continue
fi: Jatka

source: Logout
fi: Kirjaudu ulos

source: sms.not.received.text
fi: Viesti ei tullut perille?

source: msg.resent
fi: Viesti lähetetty uudelleen

source: too.many.failed.attempts
fi: Liian monta yritystä, yritä huomenna uudestaan

source: your.phone.number.missing.from.system
fi: Puhelinnumerosi puuttuu järjestelmästä, ota yhteyttä tekniseen tukeen.

source: Invalid code, sending a new one.
fi: Epäkelpo tunnusluku. Saat pian uuden tunnusluvun puhelimeesi.
