Repository: pypi-data/pypi-mirror-320
Catalog: packages/kapt-catalog/kapt_catalog-6.2.11-py3-none-any.whl/kapt_catalog/cmsplugin_list/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Sorting
fr: Tri

source: Advanced
fr: Avancé

source: None
fr: Aucune

source: APIDAE Selection
fr: Sélection APIDAE

source: APIDAE objects
fr: Fiches APIDAE

source: Search APIDAE objects
fr: Rechercher des fiches APIDAE

source: yes,no
fr: oui,non

source: Defaults to: {}
fr: Par défaut : {}

source: Either tag name or activities is required.
fr: Au moins l'un des deux champs "Sélection APIDAE" ou "Fiches APIDAE" doit être renseigné.

source: Fill only tag name or activities not both.
fr: Seulement l'un des deux champs "Sélection APIDAE" ou "Fiches APIDAE" doit être renseigné, pas les deux.

source: Selection numbers
fr: Numéros de sélections

source: Enter one selection number or many numbers separated with commas.
fr: Entrez un numéro de sélection ou plusieurs numéros séparés par des virgules.

source: Number of results per page
fr: Nombre de résultats par page

source: Show only objects translated in the page language
fr: Afficher uniquement les objets traduits dans la langue de la page

source: Show only objects with aspect
fr: Afficher uniquement l'aspect

source: Default
fr: Par défaut

source: Random sorting
fr: Tri aléatoire

source: Per opening date sorting
fr: Tri par date d'ouverture

source: If selected, the results will contain only celebrations and manifestations.
fr: Si coché, seuls les Fêtes et Manifestations seront affichées.

source: Registered first
fr: Afficher les adhérents en premier

source: Registered and in the area first
fr: Afficher les adhérents du territoire en premier

source: Booking first
fr: Afficher les réservable en premier

source: Template
fr: Format d'affichage

source: CSS class
fr: Classe CSS

source: Filters
fr: Filtres

source: Extra informations
fr: Informations supplémentaires

source: APIDAE plugin configuration
fr: Configuration du plugin APIDAE

source: APIDEA plugin configurations
fr: Configurations des plugins APIDAE
