def t_2(var=1):
    if var == 1:
        text = """
        Для эмпирической дисперсии показать справедливость формулы: (сигма^2)^ = X^2‾ - (X‾)^2, где 1/n * сумма i=1 по n (Xi^2) 
        (сигма^2)^ = 1/n * сумма i=1 по n (Xi - X‾)^2 = sigm((Xi)^2) - 2X‾ + X‾ = X^2‾ - (X‾)^2
        """
    if var == 2:
        text = """
        Оценка 2|3|4|5
        Число 10|18|23|39
        6 преп
        x0‾ = 2*10 + 3*18 + 4*23 + 5*39/10 + 18 + 23 + 39
        N = 10 + ... + 39 = 90, n = 90/6 = 15
        E(X‾) = X0‾
        Var(X‾) = Var(X)/n * N-n/N-1
        Var(X) = (2^2 * 10 + 3^2 * 18 + 4^2 * 23 + 5^2 * 39/90) - (X0‾)^2
        """
    return text