Repository: pypi-data/pypi-mirror-320
Catalog: packages/kapt-catalog/kapt_catalog-6.2.11-py3-none-any.whl/kapt_catalog/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Complete beds
fr: Saisir les informations des lits

source: Room must be created before filling beds
fr: Une chambre doit être créée avant de pouvoir renseinger ses lits.

source: Click here to complete beds
fr: Cliquer ici pour saisir les informations des lits

source: Room
fr: Chambre

source: Rooms
fr: Chambres

source: Has a logo
fr: A un logo

source: first level characteristics
fr: caractéristique de premier niveau

source: Kapt Catalog
fr: Catalogue de kapt

source: Owner of the accommodation
fr: Propriétaire de l'hébergement

source: Agency (relay or tourism office)
fr: Office de tourisme ou agence

source: Mandatory
fr: Requis

source: Apartment
fr: Appartement

source: Boat
fr: Bateau

source: Cabin
fr: Cabane

source: Tree house
fr: Cabane dans les arbres

source: Castle
fr: Château

source: Manor
fr: Manoir

source: Ecolodge
fr: Habitat écologique

source: Townhouse
fr: Maison de ville

source: Caravan
fr: Roulotte

source: Plot
fr: Terrain

source: Garden
fr: Jardin

source: Island
fr: Île

source: Country house
fr: Maison de campagne

source: Yurt
fr: Yourte

source: Tent
fr: Tente

source: Cave dwelling
fr: Habitat troglodyte

source: Village house
fr: Maison de village

source: Bubble
fr: Bulle

source: Easy
fr: Facile

source: Medium
fr: Moyen

source: Hard
fr: Difficile

source: Lunch
fr: Midi

source: Dinner
fr: Soir

source: Size
fr: Taille

source: Reference
fr: Référence

source: Visibility
fr: Visibilité

source: This activity will only appear on the media checked.
fr: Cette activité apparaîtra uniquement sur les supports cochés.

source: Means of payment
fr: Moyens de paiement

source: Touristic labels
fr: Labels touristiques

source: Arabic
fr: Arabe

source: Azerbaijani
fr: Azerbaïdjanais

source: Bulgarian
fr: Bulgare

source: Czech
fr: Tchèque

source: Welsh
fr: Gallois

source: Danish
fr: Danois

source: German
fr: Allemand

source: Greek
fr: Grec

source: English
fr: Anglais

source: British English
fr: Anglais britannique

source: Spanish
fr: Espagnol

source: Argentinian Spanish
fr: Espagnol argentin

source: Mexican Spanish
fr: Espagnol mexicain

source: Nicaraguan Spanish
fr: Espagnol du Nicaragua

source: Venezuelan Spanish
fr: Vénézuélien espagnol

source: Estonian
fr: Estonien

source: Persian
fr: Persan

source: Finnish
fr: Finlandais

source: French
fr: Français

source: French Sign Language
fr: Langue des Signes Française

source: Irish
fr: Irlandais

source: Galician
fr: Galicien

source: Hebrew
fr: Hébreu

source: Croatian
fr: Croate

source: Hungarian
fr: Hongrois

source: Armenian
fr: Arménien

source: Indonesian
fr: Indonésien

source: Icelandic
fr: Islandais

source: Italian
fr: Italien

source: Japanese
fr: Japonais

source: Georgian
fr: Géorgien

source: Kannada
fr: Canada

source: Korean
fr: Coréen

source: Luxembourgish
fr: Luxembourgeois

source: Lithuanian
fr: Lituanien

source: Latvian
fr: Letton

source: Macedonian
fr: Macédonien

source: Malayalam
fr: Malayâlam

source: Mongolian
fr: Mongolien

source: Norwegian Bokmal
fr: Norvégien (Bokmål)

source: Nepali
fr: Népali

source: Dutch
fr: Néerlandais

source: Norwegian Nynorsk
fr: Norvégien, Nynorsk

source: Punjabi
fr: Pendjabi

source: Polish
fr: Polonais

source: Portuguese
fr: Portugais

source: Brazilian Portuguese
fr: Portugais brésilien

source: Romanian
fr: Roumain

source: Russian
fr: Russe

source: Slovak
fr: Slovaque

source: Slovenian
fr: Slovénien

source: Albanian
fr: Albanais

source: Serbian
fr: Serbe

source: Serbian Latin
fr: Serbe Latin

source: Swedish
fr: Suédois

source: Tamil
fr: Tamoul

source: Thai
fr: Thaïlandais

source: Turkish
fr: Turc

source: Udmurt
fr: Oudmourtie

source: Ukrainian
fr: Ukrainien

source: Vietnamese
fr: Vietnamien

source: Simplified Chinese
fr: Chinois simplifié

source: Traditional Chinese
fr: Chinois traditionnel

source: French sign language
fr: Langue des signes française

source: Spoken language
fr: Langue parlée

source: Spoken languages
fr: Langues parlées

source: Activity number
fr: Numéro d'activité

source: Structure reference
fr: Référence structure

source: Duplicate objects
fr: Dupliquer les objets

source: Categories activity
fr: Catégories d’activité

source: Activity reference
fr: Référence d'activité

source: Activity references
fr: Références d'activités

source: First duplicate object
fr: Premier objet en double

source: Second duplicate object
fr: Deuxième objet en double

source: Not duplicated
fr: Pas une copie

source: Duplicated
fr: Dupliqué

source: Signaled
fr: Signalé

source: Duplicated object
fr: Objet dupliqué

source: Duplicate activity
fr: Activité en double

source: Duplicate activities
fr: Activités en double

source: Name
fr: Nom

source: Activity Category
fr: Catégorie d’activité

source: Activity Categories
fr: Catégories d’activités

source: Reference slug
fr: Référence slug

source: The reference will be automatically created on save.
fr: La référence sera automatiquement crée après l'enregistrement.

source: Is complete
fr: est complet

source: Is public
fr: Est public

source: Gallery
fr: Galerie

source: Website
fr: Votre site internet

source: Referent contact
fr: Contact référent

source: Main labelling
fr: Label principal

source: Default labelling
fr: Label par défaut

source: Prefectoral labelling
fr: Label préfectoral

source: Characteristics
fr: Caractéristiques

source: Typologies promo Sitra
fr: Promo de typologies Sitra

source: Environment
fr: Environnement

source: Customer types
fr: Type de clientèle

source: Number of occurences
fr: Nombre d'occurences

source: month
fr: mois

source: year
fr: année

source: Minimum age
fr: Age minimum

source: Maximum age
fr: Age maximum

source: Minimum age unit
fr: Unité age minimum

source: Maximum age unit
fr: Unité age maximum

source: Is free
fr: Est gratuit

source: Minimum price
fr: Prix minimum

source: Maximum price
fr: Prix Maximum

source: Currency
fr: Devise

source: Booking Url
fr: Url de réservation

source: Availability Url
fr: Url de disponibilité

source: Can be booked by owner
fr: Peut-être réservé par le propriétaire

source: Can be booked by organization
fr: Peut-être réservé par l'agence (relais)

source: Average score
fr: Score moyen

source: ERP certification
fr: Certification ERP

source: Activity
fr: Activité

source: Activities
fr: Activités

source: Start date
fr: Date de début

source: End date
fr: Date de fin

source: Opening time
fr: Horaires d’arrivée

source: Closing time
fr: Heure de départ

source: Further hourly informations
fr: Plus d’informations horaires

source: Activity period
fr: Période d’activité

source: Activity periods
fr: Périodes d’activité

source: The start date must be lesser or equal than the end date
fr: La date de début doit être inférieure à la date de fin

source: An activity period must not be in contention with another period
fr: Une période d’activité ne doit pas être en contention avec une autre période

source: The opening time must be lesser than the closing time
fr: La durée d’ouverture doit être inférieur à l’heure de clôture

source: A closing time is not valid if it not comes with an opening time
fr: Une heure de fermeture n’est pas valide si elle ne vient pas avec une heure d’ouverture

source: Icon
fr: Icône

source: Rating unit
fr: Unité de classement

source: Activities that can be attached to this Label
fr: Activités qui peuvent être attachées à ce label

source: Slug identifier
fr: Identifiant normalisé

source: Touristic label
fr: Label touristique

source: Rating units
fr: Unités de classement

source: Rating
fr: Classement

source: Priority
fr: Priorité

source: 0 is high priority, 10 is low priority
fr: indiquer 0 pour une priorité haute, 10 pour une priorité basse

source: Labelling
fr: Labellisation

source: Labellings
fr: Labellisations

source: No tax
fr: Aucune taxe

source: Included in the price
fr: Inclus dans le prix

source: Not included in the price
fr: Pas compris dans le prix

source: Property type
fr: Type de propriété

source: Capacity
fr: Capacité

source: The capacity will be automatically computed according to the beds you specified
fr: La capacité est automatiquement calculée en fonction des lits que vous renseignez

source: Minimum capacity per room
fr: Capacité minimale par chambre

source: This value will be automatically computed according to the beds you specified
fr: Cette valeur sera automatiquement calculée selon les lits que vous avez spécifié

source: Maximum capacity per room
fr: Capacité maximale par chambre

source: Max Capacity
fr: Capacité maximale

source: Area
fr: Surface

source: Number of floors
fr: Nombre d'étages

source: Number of rooms
fr: Nombre de chambres

source: Light construction
fr: Hébergement léger

source: Unusual accommodation
fr: Insolite

source: Facilities
fr: Equipements

source: Technical characteristics
fr: Caractéristiques techniques

source: Land surface
fr: Surface de la terre

source: Garden surface
fr: Surface du jardin

source: Pool dimension
fr: Dimension de la piscine

source: Patio surface
fr: Surface de patio

source: Tourist tax type
fr: Type de taxe touristique

source: Deposit
fr: Caution

source: Pets deposit
fr: Caution pour les animaux

source: Check-in time
fr: Heure d'arrivée

source: Check-out time
fr: Heure de départ

source: Minimum number of nights
fr: Nombre de nuits minimum

source: Arrival days
fr: Jours d’arrivée

source: Accommodation activity
fr: Activité d'hébergement

source: Accommodation activities
fr: Activités d'hébergement

source: Monday
fr: Lundi

source: Tuesday
fr: Mardi

source: Wednesday
fr: Mercredi

source: Thursday
fr: Jeudi

source: Friday
fr: Vendredi

source: Saturday
fr: Samedi

source: Sunday
fr: Dimanche

source: Day
fr: Jour

source: Arrival day
fr: Jour d’arrivée

source: Bed & Breakfast activity
fr: Chambre d'hôtes

source: Bed & Breakfast activities
fr: Chambres d'hôtes

source: Your accommodation exceed the maximum capacity value
fr: Votre hébergement dépasse la valeur de capacité maximale

source: Rental activity
fr: Location

source: Rental activities
fr: Locations

source: Your accommodation exceed the maximum capacity value. The maximum allowed capacity for a rental without ERP certification is:
fr: Votre hébergement à atteint la capacité maximale autorisée. La capacité maximum autorisée pour une location sans certificat ERP est :

source: Number of pitches
fr: Nombre d'emplacements

source: Camping activity
fr: Camping

source: Camping activities
fr: Campings

source: Camper van activity
fr: Camping car

source: Camper van activities
fr: Camping Car

source: Ranked rooms quantity
fr: Nombre de chambres classées

source: Hotel declared rooms quantity
fr: Nombre de chambres déclarées

source: Single rooms quantity
fr: Double de chambres simples

source: Double rooms quantity
fr: Nombre de chambres doubles

source: Suite rooms quantity
fr: Nombre de suites

source: Reduced mobility rooms quantity
fr: Nombre de chambres accessibles aux PMR

source: Hotel activity
fr: Hôtel

source: Hotel activities
fr: Hôtels

source: Holiday village activity
fr: Village de vacances

source: Holiday village activities
fr: Village de vacances

source: Relay activity
fr: Relais

source: Relay activities
fr: Relais

source: Youth hostel activity
fr: Auberge de jeunesse

source: Youth hostel activities
fr: Auberges de jeunesse

source: Homestay activity
fr: Chambre chez l'habitant

source: Homestay activities
fr: Chambres chez l'habitant

source: Riad activity
fr: Riad

source: Riad activities
fr: Riads

source: Room number
fr: Numéro de la chambre

source: Room reference
fr: Référence de chambre

source: Room references
fr: Références de chambres

source: Accommodation
fr: Hébergement

source: Bed number
fr: Numéro du lit

source: Bed reference
fr: Référence de lit

source: Bed references
fr: Références de lit

source: Bed {} -
fr: Lit {} -

source: Extra bed
fr: Lit d'appoint

source: Bed
fr: Lit

source: Beds
fr: Lits

source: You must fill a value for the field 'size'
fr: Vous devez renseigner une valeur pour le champ 'taille'

source: Your accommodation raised the maximum capacity value, you can't add a new bed
fr: Votre hébergment à atteint la capacité maximale autorisée, vous ne pouvez pas ajouter des lits supplémentaires

source: Business tourism maximum capacity
fr: Capacité maximale de tourisme affaires

source: Equipped meeting rooms quantity
fr: Quantité de salles de réunion équipées

source: Adjustable rooms quantity
fr: Quantité de pièce réglable

source: Business tourism service
fr: Service de tourisme d’affaires

source: Business tourism services
fr: Services de tourisme d’affaires

source: Identifier
fr: Identifiant normalisé

source: Business tourism service description
fr: Description des services de tourisme d’affaire

source: Max capacity
fr: Capacité maximum

source: Height
fr: Hauteur

source: Natural lighting
fr: Éclairage naturel

source: Meeting room
fr: Salle de réunion

source: Meeting rooms
fr: Salles de réunion

source: Meeting room layout type
fr: Type de disposition de salle réunion

source: Meeting room layout
fr: Agencement de salle de réunion

source: Meeting room layouts
fr: Agencements de salle de réunion

source: For residents
fr: Pour les résidents

source: Regional
fr: Régional

source: National
fr: Nationale

source: Event reach
fr: Portée de l’événement

source: Event types
fr: Types d’événements

source: Event categories
fr: Catégories

source: Event activity
fr: Activité d’événement

source: Event activities
fr: Activités d’événement

source: Categories
fr: Catégories

source: Min capacity
fr: Capacité minimum

source: Elevation (m)
fr: Altitude (m)

source: Daily duration (minute)
fr: Durée quotidienne (minutes)

source: Roaming duration
fr: Durée d’itinérance

source: Duration time
fr: Durée

source: Level of difficulty
fr: Niveau de difficulté

source: Departure time
fr: Heure de départ

source: Leisure activity
fr: Activité d'animation

source: Leisure activities
fr: Activités d'animation

source: The minimum capacity can not be greater than the capacity
fr: La capacité minimum ne peut pas être plus grande que la capacité maximum.

source: Products
fr: Produits

source: Chef speciality
fr: Spécialité du chef

source: Specialties
fr: Spécialités

source: Meal activity
fr: Activité de restauration

source: Meal activities
fr: Activités de restauration

source: Product
fr: Produit

source: Distance between mealactivity and product
fr: Distance entre l'activité et le produit

source: Meal activity product
fr: Produit de l'activité de restauration

source: Meal activity products
fr: Produits de l'activité de restauration

source: Schedule type
fr: Type de planning

source: Table d'hôtes activity
fr: Table d'hôtes

source: Table d'hôtes activities
fr: Tables d'hôtes

source: You have exceed the table d'hôtes max capacity
fr: Vous avez atteint la capacité maximum autorisée pour une table d'hôtes

source: Inn activity
fr: Auberge

source: Inn activities
fr: Auberges

source: You have exceed the auberge max capacity
fr: Vous avez atteint le nombre maximal d'auberge autorisée

source: Number of days
fr: Nombre de jours

source: Number of nights
fr: Nombre de nuits

source: Pack activity
fr: Pack activité

source: Pack activities
fr: Pack activités

source: Themes
fr: Thèmes

source: Point of interest activity
fr: Point d'Intérêt

source: Points of interest activities
fr: Point d'Intérêt

source: Value
fr: Valeur

source: Is a search engine criteria
fr: est un critère du moteur de recherche

source: Is a category
fr: est une catégorie

source: Characteristic
fr: Caractéristique

source: Winter
fr: Hiver

source: Summer
fr: Été

source: Business tourism
fr: Tourisme d'affaires

source: Groups
fr: Groupes

source: Activities providers
fr: Prestataire d’activités

source: Formatted identifier
fr: Identifiant formatté

source: Former identifier
fr: Ancien identifiant

source: Last import from external script
fr: Dernière importation depuis un script externe

source: groups
fr: groupes

source: The groups this reference belongs to. A reference will get all permissions granted to each of its group.
fr: Le groupe auquel appartient la référence. Une référence aura toutes les permissions associées à chacun des groupes auxquels elle appartient.

source: External lock
fr: Verrou externe

source: Structure references
fr: Références structure

source: Integration identifier
fr: Identifiant d'intégration

source: Id basket
fr: Identifiant du panier

source: OpenSystem reference
fr: Référence OpenSystem

source: OpenSystem references
fr: Références OpenSystem

source: Grade
fr: Note

source: Color
fr: Couleur

source: Comments count
fr: Nombre d’avis

source: Date updated
fr: Date de mise à jour

source: FairGUEST reference
fr: Référence FairGUEST

source: FairGUEST references
fr: Références FairGUEST

source: Imported on
fr: Importés sur

source: Place name
fr: Nom du lieu

source: Address
fr: Adresse

source: Elevation
fr: Altitude

source: Nearby leisures
fr: Loisirs à proximité

source: Nearby services
fr: Services à proximité

source: On site services
fr: Services sur place

source: Leisure
fr: Loisire

source: Distance between leisure and structure
fr: Distance entre le loisir et la structure

source: Distance between service and structure
fr: Distance entre le service et la structure

source: Contact type for this structure
fr: Type de contact pour cette structure

source: Is referent
fr: est le contact référent

source: Structure contact
fr: Contact d'une structure

source: Structure contacts
fr: Contacts d'une structure

source: Only one contact can be set as 'referent'
fr: Un seul contact ne peut être marqué comme référent

source: Delete?
fr: Supprimer ?

source: View on site
fr: Voir sur le site

source: Add another %(verbose_name)s
fr: Ajouter un autre %(verbose_name)s

source: Close
fr: Fermer

source: Open
fr: Ouvrir
