'''
                               |~~~~~~~|
                               |       |
                               |       |
                               |       |
                               |       |
                               |       |
    |~.\\\_\~~~~~~~~~~~~~~xx~~~         ~~~~~~~~~~~~~~~~~~~~~/_//;~|
    |  \  o \_         ,XXXXX),                         _..-~ o /  |
    |    ~~\  ~-.     XXXXX`)))),                 _.--~~   .-~~~   |
     ~~~~~~~`\   ~\~~~XXX' _/ ';))     |~~~~~~..-~     _.-~ ~~~~~~~
              `\   ~~--`_\~\, ;;;\)__.---.~~~      _.-~
                ~-.       `:;;/;; \          _..-~~
                   ~-._      `''        /-~-~
                       `\              /  /
                         |         ,   | |
                          |  '        /  |
                           \/;          |
                            ;;          |
                            `;   .       |
                            |~~~-----.....|
                           | \             \
                          | /\~~--...__    |
                          (|  `\       __-\|
                          ||    \_   /~    |
                          |)     \~-'      |
                           |      | \      '
                           |      |  \    :
                            \     |  |    |
                             |    )  (    )
                              \  /;  /\  |
                              |    |/   |
                              |    |   |
                               \  .'  ||
                               |  |  | |
                               (  | |  |
                               |   \ \ |
                               || o `.)|
                               |`\\) |
                               |       |
                               |       |
'''

"""winshell定位桌面位置 - hyy制作 - VSCode插件"""
"""注意事项:打印的‘狗’可能会看不清"""
"""PrintSomething.py"""

print('PrintSomething: 1.0.0')

try:
    import winshell
    import time
    import os

except:
    import os
    import time
    os.system('pip install winshell')
    print('正在安装winshell')
    time.sleep(5)
    print('安装成功！')
    import winshell

desktop = winshell.desktop()
os.chdir(desktop)

佛祖镇楼py = [
    '"""',
    '佛祖镇楼:'
    '',
    '                       _oo0oo_',
    '                      o8888888o',
    '                      88" . "88',
    '                      (| -_- |)',
    '                      0\  =  /0',
    "                    ___/`---'\___",
    "                  .' \\|     |// '.",
    "                 / \\|||  :  |||// \ ",
    "                / _||||| -:- |||||- \ ",
    "               |   | \\\  - /// |   |",
    "               | \_|  ''\---/''  |_/ |",
    "               \  .-\__  '-'  ___/-. /",
    "             ___'. .'  /--.--\  `. .'___",
    '          ."" "<  `.___\_<|>_/___." >" "". ',
    '         | | :  `- \`.;`\ _ /`;.`/ - ` : | |',
    '         \  \ `_.   \_ __\ /__ _/   .-` /  /',
    "     =====`-.____`.___ \_____/___.-`___.-'=====",
    "                       `=---='",
    '',
    '          祝：',
    '     程序不出BUG！',
    '"""'
]

def 佛祖镇楼():
    print('')
    print('                       _oo0oo_')
    print('                      o8888888o')
    print('                      88" . "88')
    print('                      (| -_- |)')
    print('                      0\  =  /0')
    print("                    ___/`---'\___")
    print("                  .' \\|     |// '.")
    print("                 / \\|||  :  |||// \ ")
    print("                / _||||| -:- |||||- \ ")
    print("               |   | \\\  - /// |   |")
    print("               | \_|  ''\---/''  |_/ |")
    print("               \  .-\__  '-'  ___/-. /")
    print("             ___'. .'  /--.--\  `. .'___")
    print('          ."" "<  `.___\_<|>_/___." >" "". ')
    print('         | | :  `- \`.;`\ _ /`;.`/ - ` : | |')
    print('         \  \ `_.   \_ __\ /__ _/   .-` /  /')
    print("     =====`-.____`.___ \_____/___.-`___.-'=====")
    print("                       `=---='")
    print('          祝：')
    print('     程序不出BUG！')
    print('')
        
    with open('键盘.py','w',encoding='utf-8')as f:
        for lib in 佛祖镇楼py:
            f.write(lib + '\n')

    print('已生成py文件')

键盘py = [
    '"""',
    '键盘:',
    '',
    ' ┌─────────────────────────────────────────────────────────────┐',
    ' │┌───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┐│',
    ' ││Esc│!1 │@2 │#3 │$4 │%5 │^6 │&7 │*8 │(9 │)0 │_- │+= │|\ │`~ ││',
    ' │├───┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴───┤│',
    ' ││ Tab │ Q │ W │ E │ R │ T │ Y │ U │ I │ O │ P │{[ │}] │ BS  ││',
    ' │├─────┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴─────┤│',
    ' ││ Ctrl │ A │ S │ D │ F │ G │ H │ J │ K │ L │: ;│"  │ Enter  ││',
    ' │├──────┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴────┬───┤│',
    ' ││ Shift  │ Z │ X │ C │ V │ B │ N │ M │< ,│> .│? /│Shift │Fn ││',
    ' │└─────┬──┴┬──┴──┬┴───┴───┴───┴───┴───┴──┬┴───┴┬──┴┬─────┴───┘│',
    ' │      │Fn │ Alt │         Space         │ Alt │Win│   HHKB   │',
    ' │      └───┴─────┴───────────────────────┴─────┴───┘          │',
    ' └─────────────────────────────────────────────────────────────┘',
    '',
    '          祝：',
    '     程序不出BUG！',
    '',
    '"""'
]

def 键盘():
    print('')
    print(' ┌─────────────────────────────────────────────────────────────┐')
    print(' │┌───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┐│')
    print(' ││Esc│!1 │@2 │#3 │$4 │%5 │^6 │&7 │*8 │(9 │)0 │_- │+= │|\ │`~ ││')
    print(' │├───┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴───┤│')
    print(' ││ Tab │ Q │ W │ E │ R │ T │ Y │ U │ I │ O │ P │{[ │}] │ BS  ││')
    print(' │├─────┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴─────┤│')
    print(' ││ Ctrl │ A │ S │ D │ F │ G │ H │ J │ K │ L │: ;│"  │ Enter  ││')
    print(' │├──────┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴────┬───┤│')
    print(' ││ Shift  │ Z │ X │ C │ V │ B │ N │ M │< ,│> .│? /│Shift │Fn ││')
    print(' │└─────┬──┴┬──┴──┬┴───┴───┴───┴───┴───┴──┬┴───┴┬──┴┬─────┴───┘│')
    print(' │      │Fn │ Alt │         Space         │ Alt │Win│   HHKB   │')
    print(' │      └───┴─────┴───────────────────────┴─────┴───┘          │')
    print(' └─────────────────────────────────────────────────────────────┘')
    print('')
    print('          祝：')
    print('     程序不出BUG！')
    print('')
    
    with open('键盘.py','w',encoding='utf-8')as f:
        for lib in 键盘py:
            f.write(lib + '\n')

    print('已在桌面生成py文件！')

def 狗():
    print('可能会看不清楚:')
    print('')                           
    print('                      :;J7, :,                        ::;7:')
    print('                      ,ivYi, ,                       ;LLLFS:')
    print('                      :iv7Yi                       :7ri;j5PL')
    print('                     ,:ivYLvr                    ,ivrrirrY2X,')
    print('                     :;r@Wwz.7r:                :ivu@kexianli.')
    print('                    :iL7::,:::iiirii:ii;::::,,irvF7rvvLujL7ur')
    print('                   ri::,:,::i:iiiiiii:i:irrv177JX7rYXqZEkvv17')
    print('                ;i:, , ::::iirrririi:i:::iiir2XXvii;L8OGJr71i')
    print('              :,, ,,:   ,::ir@mingyi.irii:i:::j1jri7ZBOS7ivv,')
    print('                 ,::,    ::rv77iiiriii:iii:i::,rvLq@huhao.Li')
    print('             ,,      ,, ,:ir7ir::,:::i;ir:::i:i::rSGGYri712:')
    print('           :::  ,v7r:: ::rrv77:, ,, ,:i7rrii:::::, ir7ri7Lri')
    print('          ,     2OBBOi,iiir;r::        ,irriiii::,, ,iv7Luur:')
    print('        ,,     i78MBBi,:,:::,:,  :7FSL: ,iriii:::i::,,:rLqXv::')
    print('        :      iuMMP: :,:::,:ii;2GY7OBB0viiii:i:iii:i:::iJqL;::')
    print('       ,     ::::i   ,,,,, ::LuBBu BBBBBErii:i:i:i:i:i:i:r77ii')
    print('      ,       :       , ,,:::rruBZ1MBBqi, :,,,:::,::::::iiriri:')
    print('     ,               ,,,,::::i:  @arqiao.       ,:,, ,:::ii;i7:')
    print('    :,       rjujLYLi   ,,:::::,:::::::::,,   ,:i,:,,,,,::i:iii')
    print('    ::      BBBBBBBBB0,    ,,::: , ,:::::: ,      ,,,, ,,:::::::')
    print('    i,  ,  ,8BMMBBBBBBi     ,,:,,     ,,, , ,   , , , :,::ii::i::')
    print('    :      iZMOMOMBBM2::::::::::,,,,     ,,,,,,:,,,::::i:irr:i:::,')
    print('    i   ,,:;u0MBMOG1L:::i::::::  ,,,::,   ,,, ::::::i:i:iirii:i:i:')
    print('    :    ,iuUuuXUkFu7i:iii:i:::, :,:,: ::::::::i:i:::::iirr7iiri::')
    print('    :     :rk@Yizero.i:::::, ,:ii:::::::i:::::i::,::::iirrriiiri::,')
    print('     :      5BMBBBBBBSr:,::rv2kuii:::iii::,:i:,, , ,,:,:i@petermu.,')
    print('          , :r50EZ8MBBBBGOBBBZP7::::i::,:::::,: :,:,::i;rrririiii::')
    print('              :jujYY7LS0ujJL7r::,::i::,::::::::::::::iirirrrrrrr:ii:')
    print('           ,:  :@kevensun.:,:,,,::::i:i:::::,,::::::iir;ii;7v77;ii;i,')
    print('           ,,,     ,,:,::::::i:iiiii:i::::,, ::::iiiir@xingjief.r;7:i,')
    print('        , , ,,,:,,::::::::iiiiiiiiii:,:,:::::::::iiir;ri7vL77rrirri::')
    print('         :,, , ::::::::i:::i:::i:i::,,,,,:,::i:i:::iir;@Secbone.ii:::')
    print('')

耶稣py = [
    '耶稣:',
    '',
    '                               |~~~~~~~|',
    "                               |       |",
    "                               |       |",
    "                               |       |",
    "                               |       |",
    "                               |       |",
    "    |~.\\\_\~~~~~~~~~~~~~~xx~~~         ~~~~~~~~~~~~~~~~~~~~~/_//;~|",
    "    |  \  o \_         ,XXXXX),                         _..-~ o /  |",
    "    |    ~~\  ~-.     XXXXX`)))),                 _.--~~   .-~~~   |",
    "     ~~~~~~~`\   ~\~~~XXX' _/ ';))     |~~~~~~..-~     _.-~ ~~~~~~~",
    "              `\   ~~--`_\~\, ;;;\)__.---.~~~      _.-~",
    "                ~-.       `:;;/;; \          _..-~~",
    "                   ~-._      `''        /-~-~",
    "                       `\              /  /",
    "                         |         ,   | |",
    "                          |  '        /  |",
    "                           \/;          |",
    "                            `;   .       |",
    "                            |~~~-----.....|",
    "                           | \             \ ",
    "                          | /\~~--...__    |",
    "                          (|  `\       __-\|",
    "                          ||    \_   /~    |",
    "                          |)     \~-'      |",
    "                           |      | \      '",
    "                           |      |  \    :",
    "                            \     |  |    |",
    "                             |    )  (    )",
    "                              \  /;  /\  |",
    "                              |    |/   |",
    "                              |    |   |",
    "                               \  .'  ||",
    "                               |  |  | |",
    "                               (  | |  |",
    "                               |   \ \ |",
    "                               || o `.)|",
    "                               |`\\) |",
    "                               |       |",
    "                               |       |"
]

def 耶稣():
    print('                               |~~~~~~~|')
    print('                               |       |')
    print('                               |       |')
    print('                               |       |')
    print('                               |       |')
    print('                               |       |')
    print('    |~.\\\_\~~~~~~~~~~~~~~xx~~~         ~~~~~~~~~~~~~~~~~~~~~/_//;~|')
    print('    |  \  o \_         ,XXXXX),                         _..-~ o /  |')
    print('    |    ~~\  ~-.     XXXXX`)))),                 _.--~~   .-~~~   |')
    print("     ~~~~~~~`\   ~\~~~XXX' _/ ';))     |~~~~~~..-~     _.-~ ~~~~~~~")
    print('              `\   ~~--`_\~\, ;;;\)__.---.~~~      _.-~')
    print('                ~-.       `:;;/;; \          _..-~~')
    print('                   ~-._      `''        /-~-~')
    print('                       `\              /  /')
    print('                         |         ,   | |')
    print("                          |  '        /  |")
    print('                           \/;          |')
    print("                            `;   .       |")
    print('                            |~~~-----.....|')
    print('                           | \             \ ')
    print('                          | /\~~--...__    |')
    print('                          (|  `\       __-\|')
    print('                          ||    \_   /~    |')
    print("                          |)     \~-'      |")
    print("                           |      | \      '")
    print("                           |      |  \    :")
    print("                            \     |  |    |")
    print("                             |    )  (    )")
    print("                              \  /;  /\  |")
    print("                              |    |/   |")
    print('                              |    |   |')
    print("                               \  .'  ||")
    print("                               |  |  | |")
    print("                               (  | |  |")
    print('                               |   \ \ |')
    print('                               || o `.)|')
    print('                               |`\\) |')
    print('                               |       |')
    print('                               |       |')
    print('')
            
    with open('耶稣.py','w',encoding='utf-8')as f:
        for lib in 耶稣py:
            f.write(lib + '\n')

    print('已生成py文件')